ehughes/minimonkey-sw/SRC/MiniMonkeyEye/board/pin_mux.h
/*! @name PIO0_28 (coord F13), LCD_RST
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCD_RST_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LCD_RST_GPIO_PIN_MASK (1U << 28U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LCD_RST_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_RST_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_RST_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_1 (coord G11), SPI_SSEL
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SPI_SSEL_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_SPI_SSEL_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_SPI_SSEL_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_SSEL_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_SSEL_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_26 (coord H12), SPI_MOSI
  @{ */
#define BOARD_INITPINS_SPI_MOSI_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_MOSI_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_MOSI_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_2 (coord G12), SPI_SCK
  @{ */
#define BOARD_INITPINS_SPI_SCLK_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SPI_SCLK_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SPI_SCLK_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_3 (coord G13), LCD_CMD_DATA
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCD_CMD_DATA_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LCD_CMD_DATA_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LCD_CMD_DATA_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_CMD_DATA_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_CMD_DATA_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO0_5 (coord A7), BTN1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BTN1_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BTN1_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_BTN1_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BTN1_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BTN1_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO1_19 (coord H13), BTN2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BTN2_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BTN2_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_BTN2_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BTN2_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BTN2_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO1_22 (coord M8), BTN3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BTN3_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BTN3_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_BTN3_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BTN3_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BTN3_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO0_2 (coord B11), WS
  @{ */
#define BOARD_INITPINS_WS_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_WS_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_WS_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PIO0_6 (coord B7), SCK
  @{ */
#define BOARD_INITPINS_SCK_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SCK_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SCK_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PIO0_3 (coord F8), MIC_DAT
  @{ */
#define BOARD_INITPINS_MIC_DAT_PORT 0U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MIC_DAT_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MIC_DAT_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO1_17 (coord J9), LCD_BL
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCD_BL_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LCD_BL_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LCD_BL_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_BL_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_BL_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_10 (coord F2), SWO
  @{ */
#define BOARD_INITPINS_SWO_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_SWO_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_SWO_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PIO0_13 (coord C12), FC1_SDA
  @{ */
#define BOARD_INITPINS_FC1_SDA_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_FC1_SDA_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_FC1_SDA_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_14 (coord C13), FC1_SCL
  @{ */
#define BOARD_INITPINS_FC1_SCL_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_FC1_SCL_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_FC1_SCL_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_31 (coord H6), PIO1_31
  @{ */

