ehughes/minimonkey-sw/SRC/MiniMonkeyEye/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PIO1_31_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PIO1_31_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_PIO1_31_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PIO1_31_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PIO1_31_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_15 (coord L2), PIO0_15
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PIO0_15_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PIO0_15_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_PIO0_15_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PIO0_15_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PIO0_15_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_16 (coord J2), PIO0_16
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PIO0_16_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PIO0_16_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_PIO0_16_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PIO0_16_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PIO0_16_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_23 (coord J1), PIO0_23
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PIO0_23_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PIO0_23_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_PIO0_23_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PIO0_23_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PIO0_23_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_4 (coord B2), PIO1_4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PIO1_4_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PIO1_4_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_PIO1_4_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PIO1_4_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PIO1_4_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO0_31 (coord L1), PIO0_31
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PIO0_31_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PIO0_31_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_PIO0_31_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PIO0_31_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PIO0_31_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_27 (coord N2), PIO0_27
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PIO0_27_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PIO0_27_GPIO_PIN_MASK (1U << 27U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_PIO0_27_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PIO0_27_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PIO0_27_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
